; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=300, out_folder=./training, instance_id=18, seed=2042, goal_proportion=0.03

(define (problem blocksworld-18)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 b232 b233 b234 b235 b236 b237 b238 b239 b240 b241 b242 b243 b244 b245 b246 b247 b248 b249 b250 b251 b252 b253 b254 b255 b256 b257 b258 b259 b260 b261 b262 b263 b264 b265 b266 b267 b268 b269 b270 b271 b272 b273 b274 b275 b276 b277 b278 b279 b280 b281 b282 b283 b284 b285 b286 b287 b288 b289 b290 b291 b292 b293 b294 b295 b296 b297 b298 b299 b300 - object)
 (:init 
    (arm-empty)
    (clear b143)
    (on-table b143)
    (clear b193)
    (on-table b193)
    (clear b83)
    (on b83 b71)
    (on b71 b14)
    (on b14 b117)
    (on b117 b46)
    (on b46 b299)
    (on-table b299)
    (clear b161)
    (on b161 b95)
    (on b95 b212)
    (on-table b212)
    (clear b74)
    (on b74 b234)
    (on b234 b89)
    (on b89 b119)
    (on-table b119)
    (clear b225)
    (on b225 b168)
    (on b168 b213)
    (on b213 b27)
    (on b27 b205)
    (on b205 b281)
    (on b281 b88)
    (on b88 b214)
    (on-table b214)
    (clear b97)
    (on b97 b62)
    (on-table b62)
    (clear b217)
    (on b217 b177)
    (on b177 b187)
    (on b187 b236)
    (on-table b236)
    (clear b35)
    (on b35 b247)
    (on b247 b122)
    (on-table b122)
    (clear b138)
    (on-table b138)
    (clear b79)
    (on b79 b181)
    (on b181 b223)
    (on b223 b171)
    (on b171 b300)
    (on b300 b96)
    (on b96 b68)
    (on-table b68)
    (clear b284)
    (on b284 b19)
    (on b19 b282)
    (on b282 b292)
    (on-table b292)
    (clear b140)
    (on-table b140)
    (clear b229)
    (on-table b229)
    (clear b266)
    (on b266 b8)
    (on b8 b285)
    (on b285 b184)
    (on-table b184)
    (clear b246)
    (on b246 b151)
    (on b151 b166)
    (on-table b166)
    (clear b24)
    (on b24 b237)
    (on-table b237)
    (clear b10)
    (on b10 b191)
    (on b191 b51)
    (on-table b51)
    (clear b290)
    (on-table b290)
    (clear b218)
    (on b218 b26)
    (on b26 b185)
    (on b185 b153)
    (on b153 b279)
    (on b279 b199)
    (on b199 b21)
    (on b21 b189)
    (on-table b189)
    (clear b276)
    (on b276 b277)
    (on b277 b176)
    (on b176 b115)
    (on b115 b167)
    (on-table b167)
    (clear b146)
    (on b146 b40)
    (on b40 b137)
    (on b137 b109)
    (on b109 b53)
    (on b53 b194)
    (on b194 b113)
    (on b113 b156)
    (on b156 b64)
    (on b64 b257)
    (on b257 b49)
    (on b49 b254)
    (on b254 b90)
    (on b90 b144)
    (on b144 b70)
    (on b70 b245)
    (on-table b245)
    (clear b248)
    (on b248 b297)
    (on-table b297)
    (clear b175)
    (on b175 b72)
    (on b72 b39)
    (on-table b39)
    (clear b94)
    (on b94 b162)
    (on b162 b32)
    (on-table b32)
    (clear b73)
    (on b73 b186)
    (on-table b186)
    (clear b173)
    (on-table b173)
    (clear b99)
    (on b99 b268)
    (on b268 b129)
    (on b129 b29)
    (on-table b29)
    (clear b48)
    (on b48 b286)
    (on-table b286)
    (clear b50)
    (on b50 b269)
    (on b269 b5)
    (on b5 b23)
    (on b23 b226)
    (on b226 b298)
    (on b298 b221)
    (on b221 b267)
    (on-table b267)
    (clear b275)
    (on b275 b61)
    (on b61 b209)
    (on-table b209)
    (clear b227)
    (on b227 b135)
    (on-table b135)
    (clear b111)
    (on b111 b169)
    (on-table b169)
    (clear b230)
    (on-table b230)
    (clear b54)
    (on b54 b38)
    (on-table b38)
    (clear b116)
    (on b116 b101)
    (on b101 b16)
    (on b16 b67)
    (on b67 b249)
    (on b249 b112)
    (on-table b112)
    (clear b255)
    (on-table b255)
    (clear b55)
    (on b55 b170)
    (on-table b170)
    (clear b92)
    (on b92 b60)
    (on b60 b253)
    (on b253 b12)
    (on-table b12)
    (clear b103)
    (on b103 b134)
    (on-table b134)
    (clear b196)
    (on b196 b44)
    (on b44 b105)
    (on b105 b192)
    (on b192 b126)
    (on b126 b58)
    (on b58 b34)
    (on b34 b28)
    (on-table b28)
    (clear b63)
    (on b63 b118)
    (on-table b118)
    (clear b293)
    (on b293 b141)
    (on-table b141)
    (clear b235)
    (on b235 b210)
    (on-table b210)
    (clear b6)
    (on b6 b180)
    (on-table b180)
    (clear b33)
    (on-table b33)
    (clear b37)
    (on b37 b250)
    (on b250 b69)
    (on b69 b133)
    (on b133 b273)
    (on b273 b2)
    (on b2 b13)
    (on b13 b22)
    (on b22 b87)
    (on b87 b9)
    (on b9 b142)
    (on b142 b242)
    (on b242 b93)
    (on b93 b66)
    (on-table b66)
    (clear b132)
    (on-table b132)
    (clear b25)
    (on-table b25)
    (clear b241)
    (on b241 b98)
    (on b98 b123)
    (on b123 b238)
    (on-table b238)
    (clear b200)
    (on b200 b263)
    (on b263 b86)
    (on b86 b195)
    (on b195 b125)
    (on-table b125)
    (clear b59)
    (on b59 b155)
    (on-table b155)
    (clear b287)
    (on b287 b182)
    (on-table b182)
    (clear b188)
    (on b188 b288)
    (on b288 b206)
    (on b206 b11)
    (on b11 b47)
    (on b47 b239)
    (on-table b239)
    (clear b15)
    (on b15 b3)
    (on b3 b148)
    (on-table b148)
    (clear b179)
    (on-table b179)
    (clear b149)
    (on-table b149)
    (clear b208)
    (on b208 b91)
    (on-table b91)
    (clear b283)
    (on b283 b220)
    (on b220 b274)
    (on b274 b76)
    (on-table b76)
    (clear b124)
    (on-table b124)
    (clear b243)
    (on b243 b7)
    (on b7 b81)
    (on b81 b190)
    (on-table b190)
    (clear b121)
    (on-table b121)
    (clear b207)
    (on b207 b82)
    (on b82 b271)
    (on b271 b130)
    (on b130 b1)
    (on b1 b174)
    (on b174 b278)
    (on b278 b201)
    (on b201 b80)
    (on b80 b18)
    (on b18 b198)
    (on b198 b165)
    (on b165 b114)
    (on b114 b222)
    (on-table b222)
    (clear b215)
    (on-table b215)
    (clear b36)
    (on b36 b100)
    (on b100 b296)
    (on b296 b265)
    (on b265 b197)
    (on b197 b110)
    (on b110 b240)
    (on b240 b202)
    (on b202 b20)
    (on b20 b84)
    (on b84 b45)
    (on-table b45)
    (clear b264)
    (on b264 b280)
    (on b280 b150)
    (on b150 b75)
    (on-table b75)
    (clear b294)
    (on b294 b219)
    (on b219 b291)
    (on b291 b147)
    (on b147 b163)
    (on-table b163)
    (clear b160)
    (on-table b160)
    (clear b251)
    (on b251 b30)
    (on b30 b41)
    (on b41 b57)
    (on b57 b102)
    (on b102 b228)
    (on b228 b233)
    (on b233 b145)
    (on b145 b232)
    (on b232 b152)
    (on b152 b108)
    (on-table b108)
    (clear b104)
    (on-table b104)
    (clear b164)
    (on b164 b270)
    (on b270 b107)
    (on b107 b295)
    (on-table b295)
    (clear b261)
    (on-table b261)
    (clear b204)
    (on b204 b85)
    (on b85 b128)
    (on b128 b260)
    (on b260 b244)
    (on-table b244)
    (clear b65)
    (on b65 b211)
    (on b211 b183)
    (on b183 b106)
    (on b106 b289)
    (on b289 b131)
    (on b131 b136)
    (on b136 b17)
    (on b17 b154)
    (on b154 b56)
    (on-table b56)
    (clear b258)
    (on-table b258)
    (clear b203)
    (on-table b203)
    (clear b157)
    (on-table b157)
    (clear b256)
    (on-table b256)
    (clear b31)
    (on b31 b42)
    (on b42 b77)
    (on b77 b159)
    (on b159 b224)
    (on-table b224)
    (clear b139)
    (on-table b139)
    (clear b262)
    (on b262 b178)
    (on b178 b272)
    (on b272 b231)
    (on-table b231)
    (clear b252)
    (on b252 b127)
    (on b127 b43)
    (on b43 b4)
    (on-table b4)
    (clear b216)
    (on b216 b52)
    (on b52 b158)
    (on b158 b78)
    (on b78 b259)
    (on-table b259)
    (clear b120)
    (on b120 b172)
    (on-table b172))
 (:goal  (and 
    (clear b9)
    (on b9 b1)
    (on b1 b7)
    (on b7 b2)
    (on b2 b6)
    (on b6 b5)
    (on b5 b8)
    (on b8 b4)
    (on-table b4)
    (clear b3)
    (on-table b3))))

; plan
1. (unstack b15 b3)
   deleted: (on b15 b3) (clear b15) (arm-empty)
   added: (holding b15) (clear b3)
   goals met: 2 of 11
2. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 2 of 11
3. (unstack b3 b148)
   deleted: (on b3 b148) (clear b3) (arm-empty)
   added: (holding b3) (clear b148)
   goals met: 1 of 11
4. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 3 of 11
5. (unstack b207 b82)
   deleted: (on b207 b82) (clear b207) (arm-empty)
   added: (holding b207) (clear b82)
   goals met: 3 of 11
6. (putdown b207)
   deleted: (holding b207)
   added: (clear b207) (arm-empty) (on-table b207)
   goals met: 3 of 11
7. (unstack b243 b7)
   deleted: (on b243 b7) (clear b243) (arm-empty)
   added: (holding b243) (clear b7)
   goals met: 3 of 11
8. (putdown b243)
   deleted: (holding b243)
   added: (clear b243) (arm-empty) (on-table b243)
   goals met: 3 of 11
9. (unstack b252 b127)
   deleted: (on b252 b127) (clear b252) (arm-empty)
   added: (holding b252) (clear b127)
   goals met: 3 of 11
10. (putdown b252)
   deleted: (holding b252)
   added: (clear b252) (arm-empty) (on-table b252)
   goals met: 3 of 11
11. (unstack b127 b43)
   deleted: (on b127 b43) (clear b127) (arm-empty)
   added: (holding b127) (clear b43)
   goals met: 3 of 11
12. (putdown b127)
   deleted: (holding b127)
   added: (clear b127) (arm-empty) (on-table b127)
   goals met: 3 of 11
13. (unstack b266 b8)
   deleted: (on b266 b8) (clear b266) (arm-empty)
   added: (holding b266) (clear b8)
   goals met: 3 of 11
14. (putdown b266)
   deleted: (holding b266)
   added: (clear b266) (arm-empty) (on-table b266)
   goals met: 3 of 11
15. (unstack b37 b250)
   deleted: (on b37 b250) (clear b37) (arm-empty)
   added: (holding b37) (clear b250)
   goals met: 3 of 11
16. (putdown b37)
   deleted: (holding b37)
   added: (clear b37) (arm-empty) (on-table b37)
   goals met: 3 of 11
17. (unstack b250 b69)
   deleted: (on b250 b69) (clear b250) (arm-empty)
   added: (holding b250) (clear b69)
   goals met: 3 of 11
18. (putdown b250)
   deleted: (holding b250)
   added: (clear b250) (arm-empty) (on-table b250)
   goals met: 3 of 11
19. (unstack b43 b4)
   deleted: (on b43 b4) (clear b43) (arm-empty)
   added: (holding b43) (clear b4)
   goals met: 3 of 11
20. (putdown b43)
   deleted: (holding b43)
   added: (clear b43) (arm-empty) (on-table b43)
   goals met: 3 of 11
21. (unstack b50 b269)
   deleted: (on b50 b269) (clear b50) (arm-empty)
   added: (holding b50) (clear b269)
   goals met: 3 of 11
22. (putdown b50)
   deleted: (holding b50)
   added: (clear b50) (arm-empty) (on-table b50)
   goals met: 3 of 11
23. (unstack b269 b5)
   deleted: (on b269 b5) (clear b269) (arm-empty)
   added: (holding b269) (clear b5)
   goals met: 3 of 11
24. (putdown b269)
   deleted: (holding b269)
   added: (clear b269) (arm-empty) (on-table b269)
   goals met: 3 of 11
25. (unstack b69 b133)
   deleted: (on b69 b133) (clear b69) (arm-empty)
   added: (holding b69) (clear b133)
   goals met: 3 of 11
26. (putdown b69)
   deleted: (holding b69)
   added: (clear b69) (arm-empty) (on-table b69)
   goals met: 3 of 11
27. (unstack b133 b273)
   deleted: (on b133 b273) (clear b133) (arm-empty)
   added: (holding b133) (clear b273)
   goals met: 3 of 11
28. (putdown b133)
   deleted: (holding b133)
   added: (clear b133) (arm-empty) (on-table b133)
   goals met: 3 of 11
29. (unstack b273 b2)
   deleted: (on b273 b2) (clear b273) (arm-empty)
   added: (holding b273) (clear b2)
   goals met: 3 of 11
30. (putdown b273)
   deleted: (holding b273)
   added: (clear b273) (arm-empty) (on-table b273)
   goals met: 3 of 11
31. (unstack b82 b271)
   deleted: (on b82 b271) (clear b82) (arm-empty)
   added: (holding b82) (clear b271)
   goals met: 3 of 11
32. (putdown b82)
   deleted: (holding b82)
   added: (clear b82) (arm-empty) (on-table b82)
   goals met: 3 of 11
33. (unstack b271 b130)
   deleted: (on b271 b130) (clear b271) (arm-empty)
   added: (holding b271) (clear b130)
   goals met: 3 of 11
34. (putdown b271)
   deleted: (holding b271)
   added: (clear b271) (arm-empty) (on-table b271)
   goals met: 3 of 11
35. (unstack b130 b1)
   deleted: (on b130 b1) (clear b130) (arm-empty)
   added: (holding b130) (clear b1)
   goals met: 3 of 11
36. (putdown b130)
   deleted: (holding b130)
   added: (clear b130) (arm-empty) (on-table b130)
   goals met: 3 of 11
37. (unstack b2 b13)
   deleted: (on b2 b13) (clear b2) (arm-empty)
   added: (holding b2) (clear b13)
   goals met: 3 of 11
38. (stack b2 b6)
   deleted: (clear b6) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b6)
   goals met: 4 of 11
39. (unstack b13 b22)
   deleted: (on b13 b22) (clear b13) (arm-empty)
   added: (holding b13) (clear b22)
   goals met: 4 of 11
40. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 4 of 11
41. (unstack b22 b87)
   deleted: (on b22 b87) (clear b22) (arm-empty)
   added: (holding b22) (clear b87)
   goals met: 4 of 11
42. (putdown b22)
   deleted: (holding b22)
   added: (clear b22) (arm-empty) (on-table b22)
   goals met: 4 of 11
43. (unstack b87 b9)
   deleted: (on b87 b9) (clear b87) (arm-empty)
   added: (holding b87) (clear b9)
   goals met: 5 of 11
44. (putdown b87)
   deleted: (holding b87)
   added: (clear b87) (arm-empty) (on-table b87)
   goals met: 5 of 11
45. (unstack b1 b174)
   deleted: (on b1 b174) (clear b1) (arm-empty)
   added: (holding b1) (clear b174)
   goals met: 5 of 11
46. (stack b1 b7)
   deleted: (clear b7) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b7)
   goals met: 6 of 11
47. (unstack b5 b23)
   deleted: (on b5 b23) (clear b5) (arm-empty)
   added: (holding b5) (clear b23)
   goals met: 6 of 11
48. (stack b5 b8)
   deleted: (clear b8) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b8)
   goals met: 7 of 11
49. (unstack b9 b142)
   deleted: (on b9 b142) (clear b9) (arm-empty)
   added: (holding b9) (clear b142)
   goals met: 6 of 11
50. (stack b9 b1)
   deleted: (clear b1) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b1)
   goals met: 8 of 11
51. (unstack b2 b6)
   deleted: (on b2 b6) (clear b2) (arm-empty)
   added: (holding b2) (clear b6)
   goals met: 7 of 11
52. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 7 of 11
53. (unstack b6 b180)
   deleted: (on b6 b180) (clear b6) (arm-empty)
   added: (holding b6) (clear b180)
   goals met: 7 of 11
54. (stack b6 b5)
   deleted: (clear b5) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b5)
   goals met: 8 of 11
55. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 8 of 11
56. (stack b2 b6)
   deleted: (clear b6) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b6)
   goals met: 9 of 11
57. (unstack b9 b1)
   deleted: (on b9 b1) (clear b9) (arm-empty)
   added: (holding b9) (clear b1)
   goals met: 7 of 11
58. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 8 of 11
59. (unstack b1 b7)
   deleted: (on b1 b7) (clear b1) (arm-empty)
   added: (holding b1) (clear b7)
   goals met: 7 of 11
60. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 7 of 11
61. (unstack b7 b81)
   deleted: (on b7 b81) (clear b7) (arm-empty)
   added: (holding b7) (clear b81)
   goals met: 7 of 11
62. (stack b7 b2)
   deleted: (clear b2) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b2)
   goals met: 8 of 11
63. (pickup b9)
   deleted: (clear b9) (on-table b9) (arm-empty)
   added: (holding b9)
   goals met: 7 of 11
64. (stack b9 b1)
   deleted: (clear b1) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b1)
   goals met: 9 of 11
65. (unstack b7 b2)
   deleted: (on b7 b2) (clear b7) (arm-empty)
   added: (holding b7) (clear b2)
   goals met: 8 of 11
66. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 8 of 11
67. (unstack b2 b6)
   deleted: (on b2 b6) (clear b2) (arm-empty)
   added: (holding b2) (clear b6)
   goals met: 7 of 11
68. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 7 of 11
69. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 7 of 11
70. (stack b7 b2)
   deleted: (clear b2) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b2)
   goals met: 8 of 11
71. (unstack b6 b5)
   deleted: (on b6 b5) (clear b6) (arm-empty)
   added: (holding b6) (clear b5)
   goals met: 7 of 11
72. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 7 of 11
73. (unstack b5 b8)
   deleted: (on b5 b8) (clear b5) (arm-empty)
   added: (holding b5) (clear b8)
   goals met: 6 of 11
74. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 6 of 11
75. (unstack b8 b285)
   deleted: (on b8 b285) (clear b8) (arm-empty)
   added: (holding b8) (clear b285)
   goals met: 6 of 11
76. (stack b8 b4)
   deleted: (clear b4) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b4)
   goals met: 7 of 11
77. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 7 of 11
78. (stack b5 b8)
   deleted: (clear b8) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b8)
   goals met: 8 of 11
79. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 8 of 11
80. (stack b6 b5)
   deleted: (clear b5) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b5)
   goals met: 9 of 11
81. (unstack b7 b2)
   deleted: (on b7 b2) (clear b7) (arm-empty)
   added: (holding b7) (clear b2)
   goals met: 8 of 11
82. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 8 of 11
83. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 8 of 11
84. (stack b2 b6)
   deleted: (clear b6) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b6)
   goals met: 9 of 11
85. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 9 of 11
86. (stack b7 b2)
   deleted: (clear b2) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b2)
   goals met: 10 of 11
87. (unstack b9 b1)
   deleted: (on b9 b1) (clear b9) (arm-empty)
   added: (holding b9) (clear b1)
   goals met: 8 of 11
88. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 9 of 11
89. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 9 of 11
90. (stack b1 b7)
   deleted: (clear b7) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b7)
   goals met: 10 of 11
91. (pickup b9)
   deleted: (clear b9) (on-table b9) (arm-empty)
   added: (holding b9)
   goals met: 9 of 11
92. (stack b9 b1)
   deleted: (clear b1) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b1)
   goals met: 11 of 11
